[{"title":"Carrie","cover":"http://books.google.com/books/content?id=FNxGvn1SCVMC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","author":"Stephen King","status":"Available","description":"Stephen King's legendary debut, about a teenage outcast and the revenge she enacts on her classmates. Carrie White may be picked on by her classmates, but she has a gift. She can move things with her mind. Doors lock. Candles fall. This is her power and her problem. Then, an act of kindness, as spontaneous as the vicious taunts of her classmates, offers Carrie a chance to be a normal...until an unexpected cruelty turns her gift into a w","ISBN":[{"format":"ISBN_10","identifier":"0385528833"}],"owner":"59851e44c833651c292c5fde"},{"title":"Needful Things","cover":"http://books.google.com/books/content?id=jAUODAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","author":"Stephen King","status":"Available","description":"Now available for the first time in a mass-market premium paperback edition—master storyteller Stephen King presents the classic #1 New York Times bestseller about a mysterious store than can sell you whatever you desire—but not without exacting a terrible price in return. “There are two prices for this. Half…and half. One half is cash. The other is a deed. Do you understand?” The town of Castle Rock, Maine has seen its fair share of od","ISBN":[{"format":"ISBN_10","identifier":"1501143786"}],"owner":"59851e44c833651c292c5fde"},{"title":"Desperation","cover":"http://books.google.com/books/content?id=PbQACwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","author":"Stephen King","status":"Available","description":"“The terror is relentless” (Publishers Weekly) in Stephen King’s #1 national bestseller about a little mining town, Desperation, that many will enter on their way to somewhere else. But getting out is not easy as it would seem… Located off a desolate stretch of Interstate 50, Desperation, Nevada, has few connections with the rest of the world. It is a place, though, where the seams between worlds are thin. And it is a place where severa","ISBN":[{"format":"ISBN_10","identifier":"1501141163"}],"owner":"59851e44c833651c292c5fde"},{"title":"Sleeping Beauties","cover":"http://books.google.com/books/content?id=yj95AQAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api","author":"Stephen King, Owen King","status":"Available","description":"In this spectacular father/son collaboration, Stephen King and Owen King tell the highest of high-stakes stories: what might happen if women disappeared from the world of men? In a future so real and near it might be now, something happens when women go to sleep; they become shrouded in a cocoon-like gauze. If they are awakened, if the gauze wrapping their bodies is disturbed or violated, the women become feral and spectacularly violent","ISBN":[{"format":"ISBN_10","identifier":"150116340X"}],"owner":"59851e44c833651c292c5fde"},{"title":"Thinner","cover":"http://books.google.com/books/content?id=_LYACwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","author":"Stephen King","status":"Available","description":"The “extraordinary” (Booklist) novel of one man’s quest to find the source of his nightmare and to reverse it before he becomes…nothing at all. This #1 national bestseller from Stephen King, writing as Richard Bachman, “pulsates with evil…it will have you on the edge of your seat” (Publishers Weekly). “You can’t do anything… It’s gone too far. You understand, Halleck? Too…far. Attorney Billy Halleck seriously enjoys living his life of u","ISBN":[{"format":"ISBN_10","identifier":"1501141368"}],"owner":"59851e44c833651c292c5fde"},{"title":"The Stand","cover":"http://books.google.com/books/content?id=UbfnTcmkaKkC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","author":"Stephen King","status":"Available","description":"Stephen King’s apocalyptic vision of a world blasted by plague and tangled in an elemental struggle between good and evil remains as riveting and eerily plausible as when it was first published. A patient escapes from a biological testing facility, unknowingly carrying a deadly weapon: a mutated strain of super-flu that will wipe out 99 percent of the world’s population within a few weeks. Those who remain are scared, bewildered, and in","ISBN":[{"format":"ISBN_10","identifier":"038552885X"}],"owner":"59851e44c833651c292c5fde"},{"title":"Pet Sematary","cover":"http://books.google.com/books/content?id=iEWAAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","author":"Stephen King","status":"Available","description":"Don’t miss the classic tale from King of Horror and #1 New York Times bestselling author Stephen King, described by Publishers Weekly as “the most frightening novel Stephen King has ever written.” When the Creeds move into a beautiful old house in rural Maine, it all seems too good to be true: physician father, beautiful wife, charming little daughter, adorable infant son—and now an idyllic home. As a family, they’ve got it all…right do","ISBN":[{"format":"ISBN_10","identifier":"1476794340"}],"owner":"59851e6cc833651c292c5fdf"},{"title":"Firestarter","cover":"http://books.google.com/books/content?id=ZAQODAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","author":"Stephen King","status":"Available","description":"Now available for the first time in a mass-market premium paperback edition—master storyteller Stephen King presents the classic #1 New York Times bestseller! Get out.Get out quickly.She 's never done anything like this before and I don't know if she can stop. Andy McGee and Vicky Tomlinson were once college students looking to make some extra cash, volunteering as test subjects for an experiment orchestrated by the clandestine gover","ISBN":[{"format":"ISBN_10","identifier":"1501143794"}],"owner":"59851e6cc833651c292c5fdf"},{"title":"On Writing","cover":"http://books.google.com/books/content?id=d999Z2KbZJYC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","author":"Stephen King","status":"Available","description":"The author shares his insights into the craft of writing and offers a humorous perspective on his own experience as a writer.","ISBN":[{"format":"ISBN_10","identifier":"0743455967"}],"owner":"59851e6cc833651c292c5fdf"},{"title":"Roadwork","cover":"http://books.google.com/books/content?id=OFMADAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","author":"Stephen King","status":"Available","description":"Only Stephen King, writing as Richard Bachman, can imagine the horror of a good and angry man who fights back against bureaucracy when it threatens to destroy his vitality, home, and memories. “Under any name King mesmerizes the reader” (Chicago Sun-Times). Barton Dawes’s unremarkable but comfortable existence suddenly takes a turn for the worst. A new highway extension is being built right over the laundry plant where he works—and righ","ISBN":[{"format":"ISBN_10","identifier":"1501143832"}],"owner":"59851e6cc833651c292c5fdf"},{"title":"Finders Keepers","cover":"http://books.google.com/books/content?id=c89NCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","author":"Stephen King","status":"Available","description":"A masterful, intensely suspenseful novel about a reader whose obsession with a reclusive writer goes much too far—the #1 New York Times bestseller about the power of storytelling, starring the same trio of unlikely and winning heroes Stephen King introduced in Mr. Mercedes. “Wake up, genius.” So begins King’s instantly riveting story about a vengeful reader. The genius is John Rothstein, an iconic author who created a famous character, ","ISBN":[{"format":"ISBN_10","identifier":"1501140655"}],"owner":"59851e6cc833651c292c5fdf"},{"title":"The Shining","cover":"http://books.google.com/books/content?id=8VnJLu3AvvQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","author":"Stephen King","status":"Available","description":"With an excerpt from the sequel, Doctor Sleep. Terrible events occur at an isolated hotel in the off season, when a small boy with psychic powers struggles to hold his own against the forces of evil that are driving his father insane.","ISBN":[{"format":"ISBN_10","identifier":"0385528868"}],"owner":"59851e6cc833651c292c5fdf"},{"title":"It","cover":"http://books.google.com/books/content?id=fVWQDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","author":"Stephen King","status":"Available","description":"They were seven teenagers when they first stumbled upon the horror. Now they were grown-up men and women who had gone out into the big world to gain success and happiness. But none of them could withstand the force that drew them back to Derry, Maine to face the nightmare without an end, and the evil without a name.","ISBN":[{"format":"ISBN_10","identifier":"1501156683"}],"owner":"59851e88c833651c292c5fe0"},{"title":"Misery","cover":"http://books.google.com/books/content?id=Ky5dEjKmOLIC&printsec=frontcover&img=1&zoom=1&source=gbs_api","author":"Stephen King","status":"Available","description":"After a car crash, writer Paul Sheldon is saved by his number one fan, Annie Wilkes. She brings him home, splints his mangled legs, and all he has to do in return is write a very special book, one all about her favourite character. Because if he doesn't, if he is bad, she will be cross - very cross.","ISBN":[{"format":"ISBN_10","identifier":"1848940890"}],"owner":"59851e88c833651c292c5fe0"},{"title":"Charlie the Choo-Choo","cover":"http://books.google.com/books/content?id=UjQjDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","author":"Beryl Evans","status":"Available","description":"Fans of Stephen King’s The Dark Tower will definitely want this picture book about a train engine and his devoted engineer. Engineer Bob has a secret: His train engine, Charlie the Choo-Choo, is alive…and also his best friend. From celebrated author Beryl Evans and illustrator Ned Dameron comes a story about friendship, loyalty, and hard work.","ISBN":[{"format":"ISBN_10","identifier":"1534401245"}],"owner":"59851e88c833651c292c5fe0"},{"title":"Gwendy's Button Box","cover":"http://books.google.com/books/content?id=wuMlDwAAQBAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api","author":"Stephen King, Richard Chizmar","status":"Available","description":"'A resonant novella set in one of King's signature locales: the small town of Castle Rock, Maine' Washington Post The small town of CASTLE ROCK, MAINE has witnessed some strange events and unusual visitors over the years, but there is one story that has never been told...until now. There are three ways up to Castle View from the town of Castle Rock: Route 117, Pleasant Road, and the Suicide Stairs. Every day in the summer of 1974 twelve","ISBN":[{"format":"ISBN_10","identifier":"1473672104"}],"owner":"59851e88c833651c292c5fe0"},{"title":"Dreamcatcher","cover":"http://books.google.com/books/content?id=J_Kw1oREJcUC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","author":"Stephen King","status":"Available","description":"Once upon a time, in the haunted city of Derry (site of the classics It and Insomnia), four boys stood together and did a brave thing. Certainly a good thing, perhaps even a great thing. Something that changed them in ways they could never begin to understand. Twenty-five years later, the boys are now men with separate lives and separate troubles. But the ties endure. Each hunting season the foursome reunite in the woods of Maine. This ","ISBN":[{"format":"ISBN_10","identifier":"0743221885"}],"owner":"59851e88c833651c292c5fe0"},{"title":"The Mist","cover":"http://books.google.com/books/content?id=41LdDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","author":"Stephen King","status":"Available","description":"Soon to be a television series on Spike TV #1 New York Times bestselling author Stephen King’s terrifying novella about a town engulfed in a dense, mysterious mist—as humanity makes its last stand against unholy destruction… In the wake of a destructive Maine summer thunderstorm, an impenetrable mist descends from the direction of a local military facility and infiltrates the small town of Bridgton. David Drayton and his son Billy are d","ISBN":[{"format":"ISBN_10","identifier":"1501176242"}],"owner":"59851e88c833651c292c5fe0"},{"title":"The Dead Zone","cover":"http://books.google.com/books/content?id=ZbUACwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","author":"Stephen King","status":"Available","description":"Now available for the first time in a mass-market premium paperback edition—the #1 New York Times bestseller of a reluctant clairvoyant who must weigh his options when he suddenly sees the terrible future awaiting mankind. When Johnny Smith was six-years-old, head trauma caused by a bad ice-skating accident left him with a nasty bruise on his forehead and, from time to time, those hunches...infrequent but accurate snippets of things to ","ISBN":[{"format":"ISBN_10","identifier":"1501141155"}],"owner":"59851eaac833651c292c5fe1"},{"title":"The Tommyknockers","cover":"http://books.google.com/books/content?id=yWiMCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","author":"Stephen King","status":"Available","description":"On a beautiful June day, while walking deep in the woods on her property in Haven, Maine, Bobbi Anderson quite literally stumbles over her own destiny and that of the entire town. For the dull gray metal protrusion she discovers in the ground is part of a mysterious and massive metal object, one that may have been buried there for millennia. Bobbi can't help but become obsessed and try to dig it out ... the consequences of which will af","ISBN":[{"format":"ISBN_10","identifier":"1501144286"}],"owner":"59851eaac833651c292c5fe1"},{"title":"'Salem's Lot","cover":"http://books.google.com/books/content?id=i-KRRR_5lbQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","author":"Stephen King","status":"Available","description":"Stephen King’s second novel, the classic vampire bestseller ’SALEM’S LOT, tells the story of evil in small-town America. For the first time in a major trade edition, this terrifying novel is accompanied by previously unpublished material from King’s archive, two short stories, and eerie photographs that bring King’s fictional darkness and evil to vivid life. When Stephen King’s classic thriller’SALEM’S LOT hit the stands in 1975, it thr","ISBN":[{"format":"ISBN_10","identifier":"0385528221"}],"owner":"59851eaac833651c292c5fe1"},{"title":"Revival","cover":"http://books.google.com/books/content?id=t70XAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","author":"Stephen King","status":"Available","description":"A dark and electrifying novel about addiction, fanaticism, and what might exist on the other side of life. In a small New England town, over half a century ago, a shadow falls over a small boy playing with his toy soldiers. Jamie Morton looks up to see a striking man, the new minister. Charles Jacobs, along with his beautiful wife, will transform the local church. The men and boys are all a bit in love with Mrs. Jacobs; the women and gi","ISBN":[{"format":"ISBN_10","identifier":"1476770409"}],"owner":"59851eaac833651c292c5fe1"},{"title":"Mr. Mercedes","cover":"http://books.google.com/books/content?id=d1VXAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","author":"Stephen King","status":"Available","description":"WINNER OF THE 2015 EDGAR AWARD FOR BEST NOVEL #1 New York Times bestseller! In a high-suspense race against time, three of the most unlikely heroes Stephen King has ever created try to stop a lone killer from blowing up thousands. “Mr. Mercedes is a rich, resonant, exceptionally readable accomplishment by a man who can write in whatever genre he chooses” (The Washington Post). The stolen Mercedes emerges from the pre-dawn fog and plows ","ISBN":[{"format":"ISBN_10","identifier":"1476754462"}],"owner":"59851eaac833651c292c5fe1"},{"title":"Under the Dome: Part 2","cover":"http://books.google.com/books/content?id=s_8dAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","author":"Stephen King","status":"Available","description":"After an invisible force field seals off Chester Mills, Maine, from the rest of the world, it is up to Dale Barbara, an Iraq veteran, and a select group of citizens to save the town, if they can get past Big Jim Rennie, a murderous politician, and his son, who hides a horrible secret in his dark pantry. Reprint.","ISBN":[{"format":"ISBN_10","identifier":"1476767289"}],"owner":"59851eaac833651c292c5fe1"},{"title":"End of Watch","cover":"http://books.google.com/books/content?id=-qepCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","author":"Stephen King","status":"Available","description":"THE #1 NEW YORK TIMES BESTSELLER A New York Times Notable Book The spectacular finale to the New York Times bestselling trilogy that began with Mr. Mercedes (winner of the Edgar Award) and Finders Keepers—In End of Watch, the diabolical “Mercedes Killer” drives his enemies to suicide, and if Bill Hodges and Holly Gibney don’t figure out a way to stop him, they’ll be victims themselves. In Room 217 of the Lakes Region Traumatic Brain Inj","ISBN":[{"format":"ISBN_10","identifier":"1501134159"}],"owner":"59851eccc833651c292c5fe2"},{"title":"Heart-Shaped Box","cover":"http://books.google.com/books/content?id=N6Q2EB8HFOIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","author":"Joe Hill","status":"Available","description":"Judas Coyne is a collector of the macabre: a cookbook for cannibals . . . a used hangman's noose . . . a snuff film. An aging death-metal rock god, his taste for the unnatural is as widely known to his legions of fans as the notorious excesses of his youth. But nothing he possesses is as unlikely or as dreadful as his latest discovery, an item for sale on the Internet, a thing so terribly strange, Jude can't help but reach for his walle","ISBN":[{"format":"ISBN_10","identifier":"0061798304"}],"owner":"59851eccc833651c292c5fe2"},{"title":"Nightmares & Dreamscapes","cover":"http://books.google.com/books/content?id=qk13DqOrJqcC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","author":"Stephen King","status":"Available","description":"New to Pocket Books’ Stephen King backlist—the short story collection containing the story Dolan’ s Cadillac, soon to be released as a feature film starring Christian Slater and Wes Bentley. With numerous unforgettable movies based on his short stories—including Shawshank Redemption, 1408, and The Green Mile—readers will be delighted to rediscover this classic collection, also released as a television mini-series and on DVD. Featuring ","ISBN":[{"format":"ISBN_10","identifier":"1439163618"}],"owner":"59851eccc833651c292c5fe2"},{"title":"Misery","cover":"http://books.google.com/books/content?id=t-ArDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","author":"Stephen King","status":"Available","description":"Originally published: New York: Viking, 1987.","ISBN":[{"format":"ISBN_10","identifier":"1501156748"}],"owner":"59851eccc833651c292c5fe2"},{"title":"Children of the Corn","cover":"http://books.google.com/books/content?id=FFbgCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","author":"Stephen King","status":"Available","description":"A Vintage Shorts “Short Story Month” Selection Driving through the cornfields in rural Nebraska, Burt and Vicky run over a young boy—only to discover that they may not be responsible for his death. Out in the corn, something is watching them, and help is nowhere to be found. From the unrivaled master of horror and the supernatural, Stephen King. “Children of the Corn,” first collected in the extraordinary collection Night Shift in 1973 ","ISBN":[{"format":"ISBN_10","identifier":"1101974044"}],"owner":"59851eccc833651c292c5fe2"},{"title":"The Talisman","cover":"http://books.google.com/books/content?id=08GTcZMkvz4C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","author":"Stephen King, Peter Straub","status":"Available","description":"The iconic, “extraordinary” (The Washington Post) collaboration between #1 bestselling author Stephen King and Peter Straub—an epic thriller about a young boy’s quest to save his mother’s life. Why had twelve-year-old Jack Sawyer’s mother frantically moved the two of them from Rodeo Drive to a New York City apartment to the Alhambra, a fading ocean resort and shuttered amusement park in New Hampshire? Who or what is she running from? Sh","ISBN":[{"format":"ISBN_10","identifier":"1451698364"}],"owner":"59851eccc833651c292c5fe2"}]